app/controllers/comments_controller.rb

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
INSERT INTO "comments" ("commenter", "body", "movie_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["commenter", "aer"], ["body", "aweg"], ["movie_id", 2], ["created_at", 2017-03-26 03:18:14 UTC], ["updated_at", 2017-03-26 03:18:14 UTC]]
---
  def create
    @movie = Movie.find(params[:movie_id])
    @comment = @movie.comments.create(comment_params)

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."movie_id" = ? AND "comments"."id" = ? LIMIT ?  [["movie_id", 2], ["id", 1], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 1]]
---
  def destroy
    @movie = Movie.find(params[:movie_id])
    @comment = @movie.comments.find(params[:id])
    @comment.destroy