app/controllers/movies_controller.rb

  def index
    @movies = ::Movie.all
---
SELECT "movies".* FROM "movies"

  def create
    @movie = Movie.new(movie_params)

    if @movie.save
---
INSERT INTO "movies" ("title", "link", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", ""], ["link", "pass"], ["created_at", 2017-03-24 11:08:08 UTC], ["updated_at", 2017-03-24 11:08:08 UTC]]

  def update
    @movie = Movie.find(params[:id])
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]